"""
欢迎来到 iCoding!

_________               _____ _____                       
__  ____/______ _______ __  /____(_)_______ ____  _______ 
_  /     _  __ \__  __ \_  __/__  / __  __ \_  / / /_  _ \ 
/ /___   / /_/ /_  / / // /_  _  /  _  / / // /_/ / /  __/
\____/   \____/ /_/ /_/ \__/  /_/   /_/ /_/ \__,_/  \___/ 

这是一段2分钟的教程。

它将向你介绍两个基本功能：
1. 提问
2. 编辑代码
"""

# region —————————————————————————— 第1部分：关于代码提问 [⌘ J] ——————————————————————————


"""步骤 1: 高亮下面的函数"""


def mysterious_function(x):
    for i in range(len(x)):
        for j in range(len(x) - 1):
            if x[j] > x[j + 1]:
                x[j], x[j + 1] = x[j + 1], x[j]

    return x


"""步骤 2: 使用键盘快捷键 [⌘ J] 
选择代码并切换 iCoding 输入框"""

"""步骤 3: 提问并按下回车键"""
# 例如) 这个函数的作用是什么？
# 例如) 这个函数应该叫什么名字？

# endregion


# region ————————————————————————————————— 第2部分: 编辑代码 [⌘ I] —————————————————————————————————


"""步骤 1: 高亮这段代码"""


def bubble_sort(x):
    for i in range(len(x)):
        for j in range(len(x) - 1):
            if x[j] > x[j + 1]:
                x[j], x[j + 1] = x[j + 1], x[j]

    return x


"""步骤 2: 使用键盘快捷键 [⌘ I] 
选择代码"""

"""步骤 3: 输入修改代码的指示并按回车键"""
# 例如) "优化此函数"
# 例如) "编辑并写注释"

"""步骤 4: 使用键盘快捷键
接受 [⌥ ⇧ Y] 或者 拒绝 [⌥ ⇧ N] 该修改"""

# endregion

# 准备好了解更多？查看 iCoding 文档: https://ic0ding.netlify.app